arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_scg_hal.h
/* * Copyright (c) 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef __FSL_SCG_HAL_H__
#define __FSL_SCG_HAL_H__

#include "fsl_device_registers.h"
#include <stdbool.h>

/*! @file fsl_scg_hal.h */
#if FSL_FEATURE_SOC_SCG_COUNT

/*!
 * @addtogroup fsl_scg_hal System Clock Generator (SCG) HAL
 * @ingroup clock_manager 
 * @brief System Clock Generator Hardware Abstraction Layer
 * @{
 */

/******************************************************************************
 * Definitions
 *****************************************************************************/

/* @brief System PLL base multiplier value, it is the multiplier value when SCG_SPLLCFG[MULT]=0. */
#define SCG_SPLL_MULT_BASE 16U

/*
 * @brief System PLL base divider value, it is the PLL reference clock divider value when
 * SCG_SPLLCFG[PREDIV]=0.
 */
#define SCG_SPLL_PREDIV_BASE 1U

/* @brief Max value of SCG_SPLLCFG[MULT]. */
#define SCG_SPLL_MULT_MAX_VALUE 31U

/* @brief Max value of SCG_SPLLCFG[PREDIV]. */
#define SCG_SPLL_PREDIV_MAX_VALUE 7U

/*
 * @brief System PLL reference clock after SCG_SPLLCFG[PREDIV] should be in the range of
 * SCG_SPLL_REF_MIN to SCG_SPLL_REF_MAX.
 */
#define SCG_SPLL_REF_MIN 8000000U

/*
 * @brief System PLL reference clock after SCG_SPLLCFG[PREDIV] should be in the range of
 * SCG_SPLL_REF_MIN to SCG_SPLL_REF_MAX.
 */
#define SCG_SPLL_REF_MAX 32000000U

/* @brief EXTAL0 clock frequency. */
extern uint32_t g_xtal0ClkFreq;

/* @brief RTC_CLKIN clock frequency. */
extern uint32_t g_RtcClkInFreq;

/*!
 * @brief SCG status return code.
 */
typedef enum _scg_status
{
    STATUS_SCG_SUCCESS           = 0x0U, /*!< Success.          */
    STATUS_SCG_BUSY              = 0x1U, /*!< Clock is busy.    */
    STATUS_SCG_INVALID_PARAMETER = 0x2U, /*!< Invalid argument. */
    STATUS_SCG_INVALID_SRC       = 0x4U, /*!< Invalid source.   */
    STATUS_SCG_FAILED            = 0x8U  /*!< Execution failed. */
} scg_status_t;

/*!
 * @name System Clock.
 * @{
 */

/*!
 * @brief SCG system clock type.
 */
typedef enum _scg_system_clock_type
{
    SCG_SYSTEM_CLOCK_CORE,  /*!< Core clock.        */
    SCG_SYSTEM_CLOCK_PLAT,  /*!< Platform clock.    */
    SCG_SYSTEM_CLOCK_BUS,   /*!< BUS clock.         */
    SCG_SYSTEM_CLOCK_SLOW,  /*!< System slow clock. */
    SCG_SYSTEM_CLOCK_MAX,   /*!< Max value.         */
} scg_system_clock_type_t;

/*!
 * @brief SCG system clock source.
 */
typedef enum _scg_system_clock_src
{
    SCG_SYSTEM_CLOCK_SRC_SYS_OSC = 1U,  /*!< System OSC. */
    SCG_SYSTEM_CLOCK_SRC_SIRC    = 2U,  /*!< Slow IRC.   */
    SCG_SYSTEM_CLOCK_SRC_FIRC    = 3U,  /*!< Fast IRC.   */
    SCG_SYSTEM_CLOCK_SRC_SYS_PLL = 6U,  /*!< System PLL. */
    SCG_SYSTEM_CLOCK_SRC_NONE           /*!< MAX value.  */
} scg_system_clock_src_t;

/*!
 * @brief SCG system clock modes.
 */
typedef enum _scg_system_clock_mode
{
    SCG_SYSTEM_CLOCK_MODE_CURRENT = 0U,  /*!< Current mode.            */
    SCG_SYSTEM_CLOCK_MODE_RUN     = 1U,  /*!< Run mode.                */
    SCG_SYSTEM_CLOCK_MODE_VLPR    = 2U,  /*!< Very Low Power Run mode. */
    SCG_SYSTEM_CLOCK_MODE_HSRUN   = 3U,  /*!< High Speed Run mode.     */
    SCG_SYSTEM_CLOCK_MODE_NONE           /*!< MAX value.               */
} scg_system_clock_mode_t;

/*!
 * @brief SCG system clock divider value.
 */
typedef enum scg_system_clock_div
{
    SCG_SYSTEM_CLOCK_DIV_BY_1   = 0U,   /*!< Divided by 1. */
    SCG_SYSTEM_CLOCK_DIV_BY_2   = 1U,   /*!< Divided by 2. */
    SCG_SYSTEM_CLOCK_DIV_BY_3   = 2U,   /*!< Divided by 3. */
    SCG_SYSTEM_CLOCK_DIV_BY_4   = 3U,   /*!< Divided by 4. */
    SCG_SYSTEM_CLOCK_DIV_BY_5   = 4U,   /*!< Divided by 5. */
    SCG_SYSTEM_CLOCK_DIV_BY_6   = 5U,   /*!< Divided by 6. */
    SCG_SYSTEM_CLOCK_DIV_BY_7   = 6U,   /*!< Divided by 7. */
    SCG_SYSTEM_CLOCK_DIV_BY_8   = 7U,   /*!< Divided by 8. */
    SCG_SYSTEM_CLOCK_DIV_BY_9   = 8U,   /*!< Divided by 9. */
    SCG_SYSTEM_CLOCK_DIV_BY_10  = 9U,   /*!< Divided by 10. */
    SCG_SYSTEM_CLOCK_DIV_BY_11  = 10U,  /*!< Divided by 11. */
    SCG_SYSTEM_CLOCK_DIV_BY_12  = 11U,  /*!< Divided by 12. */
    SCG_SYSTEM_CLOCK_DIV_BY_13  = 12U,  /*!< Divided by 13. */
    SCG_SYSTEM_CLOCK_DIV_BY_14  = 13U,  /*!< Divided by 14. */
    SCG_SYSTEM_CLOCK_DIV_BY_15  = 14U,  /*!< Divided by 15. */
    SCG_SYSTEM_CLOCK_DIV_BY_16  = 15U,  /*!< Divided by 16. */
} scg_system_clock_div_t;

/*!
 * @brief SCG system clock configuration.
 */
typedef struct ScgSystemClockConfig
{
    scg_system_clock_div_t divSlow;  /*!< Slow clock divider.      */
    scg_system_clock_div_t divBus;   /*!< BUS clock divider.       */
    scg_system_clock_div_t divPlat;  /*!< Platform clock divider.  */
    scg_system_clock_div_t divCore;  /*!< Core clock divider.      */
    scg_system_clock_src_t src;      /*!< System clock source.     */
} scg_system_clock_config_t;

/* @} */

/*!
 * @brief SCG asynchronous clock type.
 */
typedef enum _scg_async_clock_type
{
    SCG_ASYNC_CLOCK_DIV1,   /*!< Clock divider 1  */
    SCG_ASYNC_CLOCK_DIV2,   /*!< Clock divider 2  */
    SCG_ASYNC_CLOCK_MAX,    /*!< Max value.       */
} scg_async_clock_type_t;

/*!
 * @brief SCG asynchronous clock divider value.
 */
typedef enum scg_async_clock_div
{
    SCG_ASYNC_CLOCK_DISABLE     = 0U,  /*!< Clock output is disabled.  */
    SCG_ASYNC_CLOCK_DIV_BY_1    = 1U,  /*!< Divided by 1.              */
    SCG_ASYNC_CLOCK_DIV_BY_2    = 2U,  /*!< Divided by 2.              */
    SCG_ASYNC_CLOCK_DIV_BY_4    = 3U,  /*!< Divided by 4.              */
    SCG_ASYNC_CLOCK_DIV_BY_8    = 4U,  /*!< Divided by 8.              */
    SCG_ASYNC_CLOCK_DIV_BY_16   = 5U,  /*!< Divided by 16.             */
    SCG_ASYNC_CLOCK_DIV_BY_32   = 6U,  /*!< Divided by 32.             */
    SCG_ASYNC_CLOCK_DIV_BY_64   = 7U,  /*!< Divided by 64.             */
} scg_async_clock_div_t;

/*!
 * @brief SCG system OSC monitor mode.
 */
typedef enum _scg_sosc_monitor_mode
{
    SCG_SOSC_MONITOR_DISABLE = 0U,                         /*!< Monitor disable.                          */
    SCG_SOSC_MONITOR_INT     = SCG_SOSCCSR_SOSCCM_MASK,    /*!< Interrupt when system OSC error detected. */
    SCG_SOSC_MONITOR_RESET   = SCG_SOSCCSR_SOSCCM_MASK |
                               SCG_SOSCCSR_SOSCCMRE_MASK,  /*!< Reset when system OSC error detected.     */
} scg_sosc_monitor_mode_t;

/*!
 * @brief SCG OSC frequency range select
 */
typedef enum _scg_sosc_range
{
    SCG_SOSC_RANGE_LOW    = 1U,  /*!< Low frequency range selected for the crystal OSC (32 kHz to 40 kHz).   */
    SCG_SOSC_RANGE_MID    = 2U,  /*!< Medium frequency range selected for the crystal OSC (1 Mhz to 8 Mhz).  */
    SCG_SOSC_RANGE_HIGH   = 3U,  /*!< High frequency range selected for the crystal OSC (8 Mhz to 32 Mhz).   */
} scg_sosc_range_t;

/*!
 * @brief SCG OSC high gain oscillator select.
 */
typedef enum _scg_sosc_gain
{
    SCG_SOSC_GAIN_LOW,  /* Configure crystal oscillator for low-power operation */
    SCG_SOSC_GAIN_HIGH  /* Configure crystal oscillator for high-gain operation */
} scg_sosc_gain_t;

/*!
 * @brief SCG OSC external reference clock select.
 */
typedef enum _scg_sosc_ext_ref_t
{
    SCG_SOSC_REF_EXT,    /* External reference clock requested    */
    SCG_SOSC_REF_OSC     /* Internal oscillator of OSC requested. */
} scg_sosc_ext_ref_t;

/*!
 * @brief SCG system OSC configuration.
 */
typedef struct ScgSysOscConfig
{
    uint32_t  freq;                       /*!< System OSC frequency.                                 */

