arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_scg_hal.h
    scg_sosc_monitor_mode_t monitorMode;   /*!< System OSC Clock monitor mode.                       */

    scg_sosc_ext_ref_t extRef;             /*!< System OSC External Reference Select.                */
    scg_sosc_gain_t    gain;               /*!< System OSC high-gain operation.                      */
    
    scg_sosc_range_t   range;              /*!< System OSC frequency range.                          */
        
    scg_async_clock_div_t div1;            /*!< Divider for platform asynchronous clock.             */
    scg_async_clock_div_t div2;            /*!< Divider for bus asynchronous clock.                  */

    bool enableInStop;                     /*!< System OSC is enable or not in stop mode.            */
    bool enableInLowPower;                 /*!< System OSC is enable or not in low power mode.       */
    bool enableErClk;                      /*!< System OSC 3V ERCLK output clock.                    */
            
    bool locked;                           /*!< System OSC Control Register can be written.          */
            
    bool initialize;                       /*!< Initialize or not the System OSC module.             */
} scg_sosc_config_t;

/*!
 * @brief SCG slow IRC clock frequency range.
 */
typedef enum _scg_sirc_range
{
    SCG_SIRC_RANGE_LOW,   /*!< Slow IRC low range clock (2 MHz).  */
    SCG_SIRC_RANGE_HIGH,  /*!< Slow IRC high range clock (8 MHz). */
} scg_sirc_range_t;

/*!
 * @brief SCG SIRC enable mode.
 */
typedef enum _scg_sirc_enable_mode
{
    SCG_SIRC_ENABLE              = SCG_SIRCCSR_SIRCEN_MASK,       /*!< Enable SIRC.              */
    SCG_SIRC_ENABLE_IN_STOP      = SCG_SIRCCSR_SIRCSTEN_MASK,     /*!< Enable SIRC in stop mode. */
    SCG_SIRC_ENABLE_IN_LOW_POWER = SCG_SIRCCSR_SIRCLPEN_MASK,     /*!< Enable SIRC in VLP mode.  */
} scg_sirc_enable_mode_t;

/*!
 * @brief SCG slow IRC clock configuration.
 */
typedef struct ScgSircConfig
{
    scg_sirc_range_t range;         /*!< Slow IRC frequency range.                 */

    scg_async_clock_div_t div1;     /*!< Divider for platform asynchronous clock.  */
    scg_async_clock_div_t div2;     /*!< Divider for bus asynchronous clock.       */
    
    bool initialize;                /*!< Initialize or not the SIRC module.        */
    bool enableInStop;              /*!< SIRC is enable or not in stop mode.       */
    bool enableInLowPower;          /*!< SIRC is enable or not in low power mode.  */
                                
    bool locked;                    /*!< SIRC Control Register can be written.     */
} scg_sirc_config_t;

/*!
 * @brief SCG fast IRC clock frequency range.
 */
typedef enum _scg_firc_range
{
    SCG_FIRC_RANGE_48M,   /*!< Fast IRC is trimmed to 48MHz.  */
    SCG_FIRC_RANGE_52M,   /*!< Fast IRC is trimmed to 52MHz.  */
    SCG_FIRC_RANGE_56M,   /*!< Fast IRC is trimmed to 56MHz.  */
    SCG_FIRC_RANGE_60M,   /*!< Fast IRC is trimmed to 60MHz.  */
} scg_firc_range_t;

/*!
 * @brief SCG FIRC enable mode.
 */
typedef enum _scg_firc_enable_mode
{
    SCG_FIRC_ENABLE              = SCG_FIRCCSR_FIRCEN_MASK,       /*!< Enable FIRC.              */
    SCG_FIRC_ENABLE_IN_STOP      = SCG_FIRCCSR_FIRCSTEN_MASK,     /*!< Enable FIRC in stop mode. */
    SCG_FIRC_ENABLE_IN_LOW_POWER = SCG_FIRCCSR_FIRCLPEN_MASK,     /*!< Enable FIRC in VLP mode.  */
} scg_firc_enable_mode_t;

/*!
 * @brief SCG fast IRC clock configuration.
 */
typedef struct ScgFircConfig
{
    scg_firc_range_t range;            /*!< Fast IRC frequency range.                 */

    scg_async_clock_div_t div1;        /*!< Divider for platform asynchronous clock.  */
    scg_async_clock_div_t div2;        /*!< Divider for bus asynchronous clock.       */

    uint8_t trimCoar;                  /*!< Trim coarse value.                        */
    uint8_t trimFine;                  /*!< Trim fine value.                          */

    
    bool enableInStop;                 /*!< FIRC is enable or not in stop mode.       */
    bool enableInLowPower;             /*!< FIRC is enable or not in lowpower mode.   */
    bool regulator;                    /*!< FIRC regulator is enable or not.          */
    bool locked;                       /*!< FIRC Control Register can be written.     */
    bool enableTrim;                   /*!< FIRC is trimmed to an external clock.     */
    bool updateTrim;                   /*!< Enable FIRC trimming updates.             */
         
    bool initialize;                   /*!< Initialize or not the FIRC module.        */
} scg_firc_config_t;

/*!
 * @brief SCG system PLL monitor mode.
 */
typedef enum _scg_spll_monitor_mode
{
    SCG_SPLL_MONITOR_DISABLE = 0U,                         /*!< Monitor disable.                          */
    SCG_SPLL_MONITOR_INT     = SCG_SPLLCSR_SPLLCM_MASK,    /*!< Interrupt when system PLL error detected. */
    SCG_SPLL_MONITOR_RESET   = SCG_SPLLCSR_SPLLCM_MASK |
                               SCG_SPLLCSR_SPLLCMRE_MASK,  /*!< Reset when system PLL error detected.     */
} scg_spll_monitor_mode_t;


/*!
 * @brief SCG system PLL configuration.
 */
typedef struct ScgSysPllConfig
{
    scg_spll_monitor_mode_t monitorMode; /*!< Clock monitor mode selected.                    */

    uint8_t        prediv;               /*!< PLL reference clock divider.                    */
    uint8_t        mult;                 /*!< System PLL multiplier.                          */

    scg_async_clock_div_t div1;          /*!< Divider for platform asynchronous clock.        */
    scg_async_clock_div_t div2;          /*!< Divider for bus asynchronous clock.             */

    bool enableInStop;                   /*!< System PLL clock is enable or not in stop mode. */

    bool locked;                         /*!< System PLL Control Register can be written.     */
    bool initialize;                     /*!< Initialize or not the System PLL module.        */
} scg_spll_config_t;

/*!
 * @brief SCG RTC configuration.
 */
typedef struct ScgRtcConfig
{
    uint32_t  rtcClkInFreq;              /*!< RTC_CLKIN frequency.                            */
    bool      initialize;                /*!< Initialize or not the RTC.                      */
} scg_rtc_config_t;

/*!
 * @brief SCG Clock Mode Configuration structure.
 */
typedef struct ScgClockModeConfig
{
    scg_system_clock_config_t rccrConfig;      /*!< Run Clock Control configuration.                 */
    scg_system_clock_config_t vccrConfig;      /*!< VLPR Clock Control configuration.                */
    scg_system_clock_config_t hccrConfig;      /*!< HSRUN Clock Control configuration.               */
    scg_system_clock_src_t    alternateClock;  /*!< Alternate clock used during initialization       */
    bool                      initialize;      /*!< Initialize or not the Clock Mode Configuration.  */
} scg_clock_mode_config_t;

/*!
 * @brief SCG configure structure.
 */
typedef struct ScgConfig
{
    scg_sirc_config_t         sircConfig;      /*!< Slow internal reference clock configuration.     */
    scg_firc_config_t         fircConfig;      /*!< Fast internal reference clock configuration.     */
    scg_sosc_config_t         soscConfig;      /*!< System oscillator configuration.                 */
    scg_spll_config_t         spllConfig;      /*!< System Phase locked loop configuration.          */
    scg_rtc_config_t          rtcConfig;       /*!< Real Time Clock configuration.                   */
    scg_clock_mode_config_t   clockModeConfig; /*!< SCG Clock Mode Configuration.                    */
} scg_config_t;

#if defined(__cplusplus)
extern "C" {
#endif

