arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_scg_hal.h
/*******************************************************************************
 * API
 ******************************************************************************/

/*!
 * @name System Clock.
 * @{
 */

/*!
 * @brief Set the system clock configuration in specified mode.
 *
 * This function sets the system configuration in specified mode.
 *
 * @param base Register base address for the SCG instance.
 * @param mode specifies the mode.
 * @param config Pointer to the configuration.
 */
void SCG_HAL_SetSystemClockConfig(SCG_Type * base,
                                  scg_system_clock_mode_t mode,
                                  scg_system_clock_config_t const *config);

/*!
 * @brief Get the system clock configuration for specified mode.
 *
 * This function gets the system configuration for specified mode.
 *
 * @param base Register base address for the SCG instance.
 * @param mode specifies the mode.
 * @param config Pointer to the configuration.
 */
void SCG_HAL_GetSystemClockConfig(SCG_Type * base,
                                  scg_system_clock_mode_t mode,
                                  scg_system_clock_config_t *config);

/* @} */

/*!
 * @name System OSC Clock.
 * @{
 */

/*!
 * @brief Get the default system OSC configuration.
 *
 * This function gets the default SCG system OSC configuration.
 *
 * @param config Pointer to the configuration structure.
 */
void SCG_HAL_GetSysOscDefaultConfig(scg_sosc_config_t *config);

/*!
 * @brief Initialize SCG system OSC.
 *
 * This function enables the SCG system OSC clock according to the
 * configuration.
 *
 * @param base Register base address for the SCG instance.
 * @param config   Pointer to the configuration structure.
 * @return Status of module initialization
 * @retval STATUS_SCG_SUCCESS System OSC is initialized.
 * @retval STATUS_SCG_BUSY System OSC has been enabled and used by system clock.
 *
 * @note This function can not detect whether system OSC has been enabled and
 * used by some IPs.
 */
scg_status_t SCG_HAL_InitSysOsc(SCG_Type * base,
                                scg_sosc_config_t const *config);

/*!
 * @brief De-initialize SCG system OSC.
 *
 * This function disables the SCG system OSC clock.
 *
 * @param base Register base address for the SCG instance.
 * @return Status of module de-initialization
 * @retval STATUS_SCG_SUCCESS System OSC is deinitialized.
 * @retval STATUS_SCG_BUSY System OSC is used by system clock.
 *
 * @note This function can not detect whether system OSC is used by some IPs.
 */
scg_status_t SCG_HAL_DeinitSysOsc(SCG_Type * base);

/*!
 * @brief Get SCG system OSC clock frequency (SYSOSC).
 *
 * @param base Register base address for the SCG instance.
 * @return  Clock frequency, if clock is invalid, return 0.
 */
uint32_t SCG_HAL_GetSysOscFreq(SCG_Type * base);

/*!
 * @brief Get SCG asynchronous clock frequency from system OSC.
 *
 * @param base Register base address for the SCG instance.
 * @param type     The asynchronous clock type.
 * @return  Clock frequency, if clock is invalid, return 0.
 */
uint32_t SCG_HAL_GetSysOscAsyncFreq(SCG_Type * base,
                                  scg_async_clock_type_t type);

/* @} */

/*!
 * @name Slow IRC Clock.
 * @{
 */

/*!
 * @brief Get the default slow IRC clock configuration.
 *
 * This function gets the default slow IRC clock configuration (SIRC).
 *
 * @param config Pointer to the configuration structure.
 */
void SCG_HAL_GetSircDefaultConfig(scg_sirc_config_t *config);

/*!
 * @brief Initialize SCG slow IRC clock.
 *
 * This function enables the SCG slow IRC clock according to the
 * configuration.
 *
 * @param base Register base address for the SCG instance.
 * @param config   Pointer to the configuration structure.
 * @return Status of module initialization
 * @retval STATUS_SCG_SUCCESS SIRC is initialized.
 * @retval STATUS_SCG_BUSY SIRC has been enabled and used by system clock.
 *
 * @note This function can not detect whether SIRC is used by some IPs.
 */
scg_status_t SCG_HAL_InitSirc(SCG_Type * base,
                              const scg_sirc_config_t *config);

/*!
 * @brief De-initialize SCG slow IRC.
 *
 * This function disables the SCG slow IRC.
 *
 * @param base Register base address for the SCG instance.
 * @return Status of module de-initialization
 * @retval STATUS_SCG_SUCCESS SIRC is deinitialized.
 * @retval STATUS_SCG_BUSY SIRC is used by system clock.
 *
 * @note This function can not detect whether SIRC is used by some IPs.
 */
scg_status_t SCG_HAL_DeinitSirc(SCG_Type * base);

/*!
 * @brief Get SCG SIRC clock frequency.
 *
 * @param base Register base address for the SCG instance.
 * @return  Clock frequency, if clock is invalid, return 0.
 */
uint32_t SCG_HAL_GetSircFreq(SCG_Type * base);

/*!
 * @brief Get SCG asynchronous clock frequency from SIRC.
 *
 * @param base Register base address for the SCG instance.
 * @param type     The asynchronous clock type.
 * @return  Clock frequency, if clock is invalid, return 0.
 */
uint32_t SCG_HAL_GetSircAsyncFreq(SCG_Type * base,
                                scg_async_clock_type_t type);

/* @} */

/*!
 * @name Fast IRC Clock.
 * @{
 */

/*!
 * @brief Get the default fast IRC clock configuration.
 *
 * This function gets the default fast IRC clock configuration (FIRC).
 * The default trim coarse value and trim fine value are all 0. If updateTrim
 * is false, then trimCoar and trimFine must be set. If updateTrim is ture,
 * then it is not necessary to set trimCoar and trimFine.
 *
 * @param config Pointer to the configuration structure.
 */
void SCG_HAL_GetFircDefaultConfig(scg_firc_config_t *config);

/*!
 * @brief Initialize SCG fast IRC clock.
 *
 * This function enables the SCG fast IRC clock according to the
 * configuration.
 *
 * @param base Register base address for the SCG instance.
 * @param config   Pointer to the configuration structure.
 * @return Status of module initialization
 * @retval STATUS_SCG_SUCCESS FIRC is initialized.
 * @retval STATUS_SCG_BUSY FIRC has been enabled and used by system clock.
 * @retval STATUS_SCG_FAILED FIRC initialization routine detected an error
 *
 * @note This function can not detect whether system OSC has been enabled and
 * used by some IPs.
 */
scg_status_t SCG_HAL_InitFirc(SCG_Type * base,
                              const scg_firc_config_t *config);

/*!
 * @brief De-initialize SCG fast IRC.
 *
 * This function disables the SCG fast IRC.
 *
 * @param base Register base address for the SCG instance.
 * @return Status of module de-initialization
 * @retval STATUS_SCG_SUCCESS FIRC is deinitialized.
 * @retval STATUS_SCG_BUSY FIRC is used by system clock.
 *
 * @note This function can not detect whether FIRC is used by some IPs.
 */
scg_status_t SCG_HAL_DeinitFirc(SCG_Type * base);

/*!
 * @brief Get SCG FIRC clock frequency.
 *
 * @param base Register base address for the SCG instance.
 * @return  Clock frequency, if clock is invalid, return 0.
 */
uint32_t SCG_HAL_GetFircFreq(SCG_Type * base);

/*!
 * @brief Get SCG asynchronous clock frequency from FIRC.
 *
 * @param base Register base address for the SCG instance.
 * @param type     The asynchronous clock type.
 * @return  Clock frequency, if clock is invalid, return 0.
 */
uint32_t SCG_HAL_GetFircAsyncFreq(SCG_Type * base,
                                scg_async_clock_type_t type);


/*!
 * @brief Get SCG system clock source.
 *
 * This function gets the SCG system clock source, these clocks are used for
 * core, platform, external and bus clock domains.
 *
 * @param base Register base address for the SCG instance.
 * @return  Clock source.
 */
static inline scg_system_clock_src_t SCG_HAL_GetSystemClockSrc(SCG_Type * base)
{
    uint32_t regValue = base->CSR;
    regValue = (regValue & SCG_CSR_SCS_MASK) >> SCG_CSR_SCS_SHIFT;
    return (scg_system_clock_src_t)regValue;
}

/*!
 * @brief Get SCG system clock frequency.
 *
 * This function gets the SCG system clock frequency, these clocks are used for
 * core, platform, external and bus clock domains.
 *
 * @param base Register base address for the SCG instance.
 * @param type     Which type of clock to get, core clock or slow clock.
 * @return  Clock frequency.
 */
uint32_t SCG_HAL_GetSystemClockFreq(SCG_Type * base,
                                  scg_system_clock_type_t type);

/* @} */


/*!
 * @name System PLL Clock.
 * @{
 */

/*!
 * @brief Get the default system PLL configuration.
 *
 * This function gets the default SCG system PLL configuration.
 *
 * @param config Pointer to the configuration structure.
 */
void SCG_HAL_GetSysPllDefaultConfig(scg_spll_config_t *config);

/*!
 * @brief Initialize SCG system PLL.
 *
 * This function enables the SCG system PLL clock according to the
 * configuration. The system PLL could use system OSC or FIRC as
 * the clock source, please make sure the source clock is valid before
 * this function.
 *
 * @param base Register base address for the SCG instance.
 * @param config   Pointer to the configuration structure.
 * @return Status of module initialization
 * @retval STATUS_SCG_SUCCESS System PLL is initialized.
 * @retval STATUS_SCG_INVALID_SRC Clock source is invalid.
 * @retval STATUS_SCG_INVALID_PARAMETER The pre-divider is invalid.
 * @retval STATUS_SCG_BUSY System PLL has been enabled and used by system clock.
 *
 * @note This function can not detect whether system PLL has been enabled and
 * used by some IPs.
 */
scg_status_t SCG_HAL_InitSysPll(SCG_Type * base,
                                scg_spll_config_t const *config);

/*!
 * @brief De-initialize SCG system PLL.
 *
 * This function disables the SCG system PLL.
 *
 * @param base Register base address for the SCG instance.
 * @return Status of module de-initialization
 * @retval STATUS_SCG_SUCCESS system PLL is deinitialized.
 * @retval STATUS_SCG_BUSY system PLL is used by system clock.
 *
 * @note This function can not detect whether system PLL is used by some IPs.
 */
scg_status_t SCG_HAL_DeinitSysPll(SCG_Type * base);

/*!
 * @brief Get SCG system PLL clock frequency.
 *
 * @param base Register base address for the SCG instance.
 * @return  Clock frequency, if clock is invalid, return 0.
 */
uint32_t SCG_HAL_GetSysPllFreq(SCG_Type * base);

/*!
 * @brief Get SCG asynchronous clock frequency from system PLL.
 *
 * @param base Register base address for the SCG instance.
 * @param type     The asynchronous clock type.
 * @return  Clock frequency, if clock is invalid, return 0.
 */
uint32_t SCG_HAL_GetSysPllAsyncFreq(SCG_Type * base,
                                  scg_async_clock_type_t type);

/* @} */

/*!
 * @name RTC Clock.
 * @{
 */

/*!
 * @brief Set SCG RTC CLKIN clock frequency.
 *
 * @param base Register base address for the SCG instance.
 * @param frequency The frequency of the RTC_CLKIN
 */
void SCG_HAL_SetRtcClkInFreq(SCG_Type * base, uint32_t frequency);

/*!
 * @brief Get SCG RTC CLKIN clock frequency.
 *
 * @param base Register base address for the SCG instance.
 * @return  Clock frequency
 */
uint32_t SCG_HAL_GetRtcClkInFreq(SCG_Type * base);

/* @} */

#if defined(__cplusplus)
extern }
#endif

/*!
 * @}
 */

#endif /* FSL_FEATURE_SOC_SCG_COUNT */
#endif /* __FSL_SCG_HAL_H__ */

/******************************************************************************
 * EOF
 *****************************************************************************/

